; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/rovers/domain.pddl
;; updates:
;;   - since actions are performed sequentially and immediately
;;     'channel_free' and 'available' predicates are removed
;;   -

(define (domain rover)
(:requirements :strips :typing)
(:types rover waypoint store camera mode lander objective)

(:predicates
    (at ?x - rover ?y - waypoint)
    (at_lander ?x - lander ?y - waypoint)
    (can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
    (equipped_for_rock_analysis ?r - rover)
    (equipped_for_imaging ?r - rover)
    (empty ?s - store)
    (have_rock_analysis ?r - rover ?w - waypoint)
    (have_soil_analysis ?r - rover ?w - waypoint)
    (full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
    (visible ?w - waypoint ?p - waypoint)
    (have_image ?r - rover ?o - objective ?m - mode)
    (communicated_soil_data ?w - waypoint)
    (communicated_rock_data ?w - waypoint)
    (communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
    (visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
)

(:action navigate
:parameters (?x - rover ?y - waypoint ?z - waypoint)
:precondition (and
    ; (can_traverse ?x ?y ?z)
    (at ?x ?y)
    ; (visible ?y ?z)
    )
:effect (and
    (not (at ?x ?y))
    (at ?x ?z))
)

(:action sample_soil
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_soil_sample ?p)
	(equipped_for_soil_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_soil_analysis ?x ?p)
    (not (at_soil_sample ?p)))
)

(:action sample_rock
:parameters (?x - rover ?s - store ?p - waypoint)
:precondition (and
    (at ?x ?p)
    (at_rock_sample ?p)
	(equipped_for_rock_analysis ?x)
	(store_of ?s ?x)
	(empty ?s))
:effect (and
    (not (empty ?s))
    (full ?s)
    (have_rock_analysis ?x ?p)
	(not (at_rock_sample ?p)))
)

(:action drop
:parameters (?x - rover ?y - store)
:precondition (and
    (store_of ?y ?x)
    (full ?y))
:effect (and
    (not (full ?y))
    (empty ?y))
)

(:action calibrate
 :parameters (?r - rover ?i - camera ?t - objective ?w - waypoint)
 :precondition (and
    (equipped_for_imaging ?r)
    (calibration_target ?i ?t)
    (at ?r ?w)
    (visible_from ?t ?w)
    (on_board ?i ?r))
 :effect (and
    (calibrated ?i ?r))
)

(:action take_image
 :parameters (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
 :precondition (and
    (calibrated ?i ?r)
    (on_board ?i ?r)
    (equipped_for_imaging ?r)
    (supports ?i ?m)
    (visible_from ?o ?p)
    (at ?r ?p))
 :effect (and
    (have_image ?r ?o ?m)
    (not (calibrated ?i ?r)))
)

(:action communicate_soil_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_soil_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_soil_data ?p))
)

(:action communicate_rock_data
 :parameters (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_rock_analysis ?r ?p)
    (visible ?x ?y))
 :effect (and
    (communicated_rock_data ?p))
)

(:action communicate_image_data
 :parameters (?r - rover ?l - lander ?o - objective ?m - mode
	      ?x - waypoint ?y - waypoint)
 :precondition (and
    (at ?r ?x)
    (at_lander ?l ?y)
    (have_image ?r ?o ?m)
    (visible ?x ?y))
 :effect (and
    (communicated_image_data ?o ?m)))
)

; problem
;; rovers=4, waypoints=10, cameras=4, objectives=9, out_folder=training/easy, instance_id=89, seed=124

(define (problem rover-89)
 (:domain rover)
 (:objects 
    general - lander
    colour high_res low_res - mode
    rover1 rover2 rover3 rover4 - rover
    rover1store rover2store rover3store rover4store - store
    waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 waypoint10 - waypoint
    camera1 camera2 camera3 camera4 - camera
    objective1 objective2 objective3 objective4 objective5 objective6 objective7 objective8 objective9 - objective)
 (:init 
    (at_lander general waypoint5)
    (at rover1 waypoint9)
    (at rover2 waypoint1)
    (at rover3 waypoint3)
    (at rover4 waypoint1)
    (equipped_for_soil_analysis rover1)
    (equipped_for_rock_analysis rover4)
    (equipped_for_rock_analysis rover3)
    (equipped_for_rock_analysis rover1)
    (equipped_for_imaging rover1)
    (equipped_for_imaging rover3)
    (equipped_for_imaging rover4)
    (equipped_for_imaging rover2)
    (empty rover1store)
    (empty rover2store)
    (empty rover3store)
    (empty rover4store)
    (store_of rover1store rover1)
    (store_of rover2store rover2)
    (store_of rover3store rover3)
    (store_of rover4store rover4)
    (at_rock_sample waypoint1)
    (at_rock_sample waypoint2)
    (at_rock_sample waypoint3)
    (at_rock_sample waypoint4)
    (at_rock_sample waypoint7)
    (at_rock_sample waypoint8)
    (at_rock_sample waypoint10)
    (at_soil_sample waypoint4)
    (at_soil_sample waypoint5)
    (at_soil_sample waypoint7)
    (at_soil_sample waypoint10)
    (visible waypoint6 waypoint2)
    (visible waypoint7 waypoint1)
    (visible waypoint6 waypoint9)
    (visible waypoint3 waypoint7)
    (visible waypoint5 waypoint4)
    (visible waypoint4 waypoint6)
    (visible waypoint9 waypoint6)
    (visible waypoint6 waypoint4)
    (visible waypoint1 waypoint4)
    (visible waypoint7 waypoint3)
    (visible waypoint6 waypoint8)
    (visible waypoint2 waypoint10)
    (visible waypoint1 waypoint7)
    (visible waypoint4 waypoint5)
    (visible waypoint2 waypoint6)
    (visible waypoint8 waypoint6)
    (visible waypoint4 waypoint1)
    (visible waypoint10 waypoint2)
    (visible waypoint3 waypoint4)
    (visible waypoint4 waypoint3)
    (visible waypoint8 waypoint10)
    (visible waypoint10 waypoint8)
    (visible waypoint2 waypoint9)
    (visible waypoint9 waypoint2)
    (visible waypoint6 waypoint7)
    (visible waypoint7 waypoint6)
    (visible waypoint1 waypoint3)
    (visible waypoint3 waypoint1)
    (can_traverse rover1 waypoint6 waypoint2)
    (can_traverse rover1 waypoint7 waypoint1)
    (can_traverse rover1 waypoint6 waypoint9)
    (can_traverse rover1 waypoint3 waypoint7)
    (can_traverse rover1 waypoint5 waypoint4)
    (can_traverse rover1 waypoint4 waypoint6)
    (can_traverse rover1 waypoint9 waypoint6)
    (can_traverse rover1 waypoint6 waypoint4)
    (can_traverse rover1 waypoint1 waypoint4)
    (can_traverse rover1 waypoint7 waypoint3)
    (can_traverse rover1 waypoint6 waypoint8)
    (can_traverse rover1 waypoint2 waypoint10)
    (can_traverse rover1 waypoint1 waypoint7)
    (can_traverse rover1 waypoint4 waypoint5)
    (can_traverse rover1 waypoint2 waypoint6)
    (can_traverse rover1 waypoint8 waypoint6)
    (can_traverse rover1 waypoint4 waypoint1)
    (can_traverse rover1 waypoint10 waypoint2)
    (can_traverse rover1 waypoint8 waypoint10)
    (can_traverse rover1 waypoint10 waypoint8)
    (can_traverse rover1 waypoint6 waypoint7)
    (can_traverse rover1 waypoint7 waypoint6)
    (can_traverse rover2 waypoint6 waypoint2)
    (can_traverse rover2 waypoint7 waypoint1)
    (can_traverse rover2 waypoint6 waypoint9)
    (can_traverse rover2 waypoint3 waypoint7)
    (can_traverse rover2 waypoint5 waypoint4)
    (can_traverse rover2 waypoint4 waypoint6)
    (can_traverse rover2 waypoint9 waypoint6)
    (can_traverse rover2 waypoint6 waypoint4)
    (can_traverse rover2 waypoint1 waypoint4)
    (can_traverse rover2 waypoint7 waypoint3)
    (can_traverse rover2 waypoint6 waypoint8)
    (can_traverse rover2 waypoint2 waypoint10)
    (can_traverse rover2 waypoint1 waypoint7)
    (can_traverse rover2 waypoint4 waypoint5)
    (can_traverse rover2 waypoint2 waypoint6)
    (can_traverse rover2 waypoint8 waypoint6)
    (can_traverse rover2 waypoint4 waypoint1)
    (can_traverse rover2 waypoint10 waypoint2)
    (can_traverse rover2 waypoint8 waypoint10)
    (can_traverse rover2 waypoint10 waypoint8)
    (can_traverse rover2 waypoint2 waypoint9)
    (can_traverse rover2 waypoint9 waypoint2)
    (can_traverse rover3 waypoint6 waypoint2)
    (can_traverse rover3 waypoint7 waypoint1)
    (can_traverse rover3 waypoint6 waypoint9)
    (can_traverse rover3 waypoint3 waypoint7)
    (can_traverse rover3 waypoint5 waypoint4)
    (can_traverse rover3 waypoint4 waypoint6)
    (can_traverse rover3 waypoint9 waypoint6)
    (can_traverse rover3 waypoint6 waypoint4)
    (can_traverse rover3 waypoint1 waypoint4)
    (can_traverse rover3 waypoint7 waypoint3)
    (can_traverse rover3 waypoint6 waypoint8)
    (can_traverse rover3 waypoint2 waypoint10)
    (can_traverse rover3 waypoint1 waypoint7)
    (can_traverse rover3 waypoint4 waypoint5)
    (can_traverse rover3 waypoint2 waypoint6)
    (can_traverse rover3 waypoint8 waypoint6)
    (can_traverse rover3 waypoint4 waypoint1)
    (can_traverse rover3 waypoint10 waypoint2)
    (can_traverse rover4 waypoint6 waypoint2)
    (can_traverse rover4 waypoint7 waypoint1)
    (can_traverse rover4 waypoint6 waypoint9)
    (can_traverse rover4 waypoint3 waypoint7)
    (can_traverse rover4 waypoint5 waypoint4)
    (can_traverse rover4 waypoint4 waypoint6)
    (can_traverse rover4 waypoint9 waypoint6)
    (can_traverse rover4 waypoint6 waypoint4)
    (can_traverse rover4 waypoint1 waypoint4)
    (can_traverse rover4 waypoint7 waypoint3)
    (can_traverse rover4 waypoint6 waypoint8)
    (can_traverse rover4 waypoint2 waypoint10)
    (can_traverse rover4 waypoint1 waypoint7)
    (can_traverse rover4 waypoint4 waypoint5)
    (can_traverse rover4 waypoint2 waypoint6)
    (can_traverse rover4 waypoint8 waypoint6)
    (can_traverse rover4 waypoint4 waypoint1)
    (can_traverse rover4 waypoint10 waypoint2)
    (can_traverse rover4 waypoint3 waypoint4)
    (can_traverse rover4 waypoint4 waypoint3)
    (can_traverse rover4 waypoint8 waypoint10)
    (can_traverse rover4 waypoint10 waypoint8)
    (can_traverse rover4 waypoint2 waypoint9)
    (can_traverse rover4 waypoint9 waypoint2)
    (can_traverse rover4 waypoint6 waypoint7)
    (can_traverse rover4 waypoint7 waypoint6)
    (can_traverse rover4 waypoint1 waypoint3)
    (can_traverse rover4 waypoint3 waypoint1)
    (calibration_target camera1 objective2)
    (on_board camera1 rover3)
    (supports camera1 high_res)
    (calibration_target camera2 objective3)
    (on_board camera2 rover1)
    (supports camera2 colour)
    (supports camera2 low_res)
    (calibration_target camera3 objective1)
    (on_board camera3 rover1)
    (supports camera3 low_res)
    (supports camera3 high_res)
    (calibration_target camera4 objective2)
    (on_board camera4 rover1)
    (supports camera4 colour)
    (supports camera4 high_res)
    (visible_from objective1 waypoint7)
    (visible_from objective1 waypoint1)
    (visible_from objective1 waypoint9)
    (visible_from objective1 waypoint2)
    (visible_from objective1 waypoint8)
    (visible_from objective1 waypoint5)
    (visible_from objective1 waypoint10)
    (visible_from objective2 waypoint7)
    (visible_from objective2 waypoint8)
    (visible_from objective2 waypoint4)
    (visible_from objective2 waypoint10)
    (visible_from objective2 waypoint2)
    (visible_from objective2 waypoint9)
    (visible_from objective3 waypoint1)
    (visible_from objective3 waypoint10)
    (visible_from objective3 waypoint3)
    (visible_from objective3 waypoint4)
    (visible_from objective3 waypoint9)
    (visible_from objective3 waypoint2)
    (visible_from objective3 waypoint7)
    (visible_from objective3 waypoint5)
    (visible_from objective4 waypoint6)
    (visible_from objective4 waypoint5)
    (visible_from objective5 waypoint2)
    (visible_from objective5 waypoint8)
    (visible_from objective5 waypoint10)
    (visible_from objective6 waypoint5)
    (visible_from objective6 waypoint10)
    (visible_from objective7 waypoint9)
    (visible_from objective7 waypoint5)
    (visible_from objective8 waypoint7)
    (visible_from objective8 waypoint4)
    (visible_from objective8 waypoint1)
    (visible_from objective8 waypoint10)
    (visible_from objective9 waypoint7)
    (visible_from objective9 waypoint5)
    (visible_from objective9 waypoint9)
    (visible_from objective9 waypoint2))
 (:goal  (and 
    
    
    (communicated_image_data objective7 colour)
    (communicated_image_data objective1 colour)
    (communicated_image_data objective3 low_res)
    (communicated_image_data objective9 low_res)
    (communicated_image_data objective4 high_res)
    (communicated_image_data objective8 colour))))

; plan
1. (calibrate rover1 camera2 objective3 waypoint9)
   added: (calibrated camera2 rover1)
   goals met: 0 of 6
2. (take_image rover1 waypoint9 objective7 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective7 colour)
   goals met: 0 of 6
3. (calibrate rover1 camera2 objective3 waypoint9)
   added: (calibrated camera2 rover1)
   goals met: 0 of 6
4. (take_image rover1 waypoint9 objective1 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective1 colour)
   goals met: 0 of 6
5. (calibrate rover1 camera2 objective3 waypoint9)
   added: (calibrated camera2 rover1)
   goals met: 0 of 6
6. (take_image rover1 waypoint9 objective9 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective9 low_res)
   goals met: 0 of 6
7. (calibrate rover1 camera3 objective1 waypoint9)
   added: (calibrated camera3 rover1)
   goals met: 0 of 6
8. (navigate rover1 waypoint9 waypoint6)
   deleted: (at rover1 waypoint9)
   added: (at rover1 waypoint6)
   goals met: 0 of 6
9. (take_image rover1 waypoint6 objective4 camera3 high_res)
   deleted: (calibrated camera3 rover1)
   added: (have_image rover1 objective4 high_res)
   goals met: 0 of 6
10. (navigate rover1 waypoint6 waypoint4)
   deleted: (at rover1 waypoint6)
   added: (at rover1 waypoint4)
   goals met: 0 of 6
11. (communicate_image_data rover1 general objective9 low_res waypoint4 waypoint5)
   added: (communicated_image_data objective9 low_res)
   goals met: 1 of 6
12. (communicate_image_data rover1 general objective1 colour waypoint4 waypoint5)
   added: (communicated_image_data objective1 colour)
   goals met: 2 of 6
13. (communicate_image_data rover1 general objective7 colour waypoint4 waypoint5)
   added: (communicated_image_data objective7 colour)
   goals met: 3 of 6
14. (communicate_image_data rover1 general objective4 high_res waypoint4 waypoint5)
   added: (communicated_image_data objective4 high_res)
   goals met: 4 of 6
15. (calibrate rover1 camera2 objective3 waypoint4)
   added: (calibrated camera2 rover1)
   goals met: 4 of 6
16. (take_image rover1 waypoint4 objective3 camera2 low_res)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective3 low_res)
   goals met: 4 of 6
17. (communicate_image_data rover1 general objective3 low_res waypoint4 waypoint5)
   added: (communicated_image_data objective3 low_res)
   goals met: 5 of 6
18. (calibrate rover1 camera2 objective3 waypoint4)
   added: (calibrated camera2 rover1)
   goals met: 5 of 6
19. (take_image rover1 waypoint4 objective8 camera2 colour)
   deleted: (calibrated camera2 rover1)
   added: (have_image rover1 objective8 colour)
   goals met: 5 of 6
20. (communicate_image_data rover1 general objective8 colour waypoint4 waypoint5)
   added: (communicated_image_data objective8 colour)
   goals met: 6 of 6
